'''
@author: caopeng
@license: (C) Copyright 2013-2049, Node Supply Chain Manager Corporation Limited. 
@contact: woshidamayi@gmail.com
@software: dof
@file: print_color.py
@time: 23/7/28 16:58
@desc: 
'''

#      前景色          显示文字       背景色
print("\033[0;31;40m 我是小杨我就这样 \033[0m")
print("\033[0;32;40m 我是小杨我就这样 \033[0m")
print("\033[0;33;40m 我是小杨我就这样 \033[0m")
print("\033[0;34;40m 我是小杨我就这样 \033[0m")
print("\033[0;35;40m 我是小杨我就这样 \033[0m")
print("\033[0;36;40m 我是小杨我就这样 \033[0m")
print("\033[0;37;40m 我是小杨我就这样 \033[0m")

print("\033[1;30m日照香炉生紫烟，遥看瀑布挂前川\033[0m")
print("\033[1;31m日照香炉生紫烟，遥看瀑布挂前川\033[0m")
print("\033[1;32m日照香炉生紫烟，遥看瀑布挂前川\033[0m")
print("\033[1;33m日照香炉生紫烟，遥看瀑布挂前川\033[0m")
print("\033[1;34m日照香炉生紫烟，遥看瀑布挂前川\033[0m")
print("\033[1;35m日照香炉生紫烟，遥看瀑布挂前川\033[0m")
print("\033[1;36m日照香炉生紫烟，遥看瀑布挂前川\033[0m")
print("\033[1;37m日照香炉生紫烟，遥看瀑布挂前川\033[0m")


print("\033[1;40m一代天骄，成吉思汗，只识弯弓射大雕\033[0m")
print("\033[1;41m一代天骄，成吉思汗，只识弯弓射大雕\033[0m")
print("\033[1;42m一代天骄，成吉思汗，只识弯弓射大雕\033[0m")
print("\033[1;43m一代天骄，成吉思汗，只识弯弓射大雕\033[0m")
print("\033[1;44m一代天骄，成吉思汗，只识弯弓射大雕\033[0m")
print("\033[1;45m一代天骄，成吉思汗，只识弯弓射大雕\033[0m")
print("\033[1;46m一代天骄，成吉思汗，只识弯弓射大雕\033[0m")
print("\033[1;47m一代天骄，成吉思汗，只识弯弓射大雕\033[0m")


print("\033[1;31;40m一代天骄，成吉思汗，只识弯弓射大雕\033[0m")
print("\033[1;31;41m一代天骄，成吉思汗，只识弯弓射大雕\033[0m")
print("\033[1;31;42m一代天骄，成吉思汗，只识弯弓射大雕\033[0m")
print("\033[1;31;43m一代天骄，成吉思汗，只识弯弓射大雕\033[0m")
print("\033[1;31;44m一代天骄，成吉思汗，只识弯弓射大雕\033[0m")
print("\033[1;31;45m一代天骄，成吉思汗，只识弯弓射大雕\033[0m")
print("\033[1;31;46m一代天骄，成吉思汗，只识弯弓射大雕\033[0m")
print("\033[1;31;47m一代天骄，成吉思汗，只识弯弓射大雕\033[0m")

print("\033[1;32m日照香炉生紫烟，")
print("遥看瀑布挂前川。")
print("飞流直下三千尺，")
print("疑是银河落九天。")
print("\033[0m")


def print_c(data, color=32):
    """
    颜色样式打印输出功能
    :param data: 打印内容
    :param color: 指定颜色, 默认为绿色(32)
    :return:
    """
    if isinstance(color, int):
        color = str(color)
    print(f"\033[1;{color}m{data}\033[0m")

for i in range(100):
    print(i, end=' ')
    print_c("颜色样式打印输出功能", i)

if __name__ == '__main__':
    print('Hello world')
